{"2023-10":[{"title":"Television cannot replace the book as a learning tool, which is why children are less well educated today. Do you agree or disagree?","date":"2023-10-16T04:40:23.000Z","link":"/2023/10/16/ielts-television/"},{"title":"Some people think that government should strictly control the supply of fresh water, as it is a limited resource, while others it should not be regulated.","date":"2023-10-16T06:41:57.000Z","link":"/2023/10/16/ielts-water/"},{"title":"The diagram illustrates how bees produce honey.","date":"2023-10-17T02:08:39.000Z","link":"/2023/10/17/ielts-honey/"},{"title":"Many manufactured food and drink products contain high levels of sugar, which causes many health problems. Sugary products should be made more expansive to encourage people to consume less sugar. Do you agree or disagree?","date":"2023-10-18T01:36:04.000Z","link":"/2023/10/18/ielts-sugar/"},{"title":"Nowadays, a growing number of people with health problems are trying alternative medicines and treatments instead of visiting their usual doctor.","date":"2023-10-19T01:37:56.000Z","link":"/2023/10/19/ielts-treatments/"},{"title":"關於我參加軟體工程師的專題班的那些事","date":"2023-10-20T04:00:49.000Z","link":"/2023/10/20/course-hex/"},{"title":"Some people say that the main environmental problem of our time is the loss of particular species of plants and animals. Other say that there are more import environmental problems.","date":"2023-10-21T05:26:55.000Z","link":"/2023/10/21/ielts-environment/"},{"title":"The diagram show the recycling process of aluminum cans.","date":"2023-10-23T01:32:48.000Z","link":"/2023/10/23/ielts-recycling/"},{"title":"The pie chart below show how much money is spent in the budget on different sectors by the UAE government in 2000.","date":"2023-10-25T01:46:52.000Z","link":"/2023/10/25/ielts-expenditure/"},{"title":"A lot of places in the world rely on tourism as a main source of income. Unfortunately, tourism can also be a source of problems if it is not managed correctly.","date":"2023-10-26T01:56:25.000Z","link":"/2023/10/26/ielts-tourism/"},{"title":"In their advertising, business nowadays usually emphasize that their products are new in some way. Why is this?","date":"2023-10-27T04:27:39.000Z","link":"/2023/10/27/ielts-advertising/"},{"title":"A lot of people have become dependent on technology as it plays a big role in our daily lives.","date":"2023-10-29T01:46:03.000Z","link":"/2023/10/29/ietls-technology/"},{"title":"The bar chart below shows the popularity of well-known Instagram accounts in 2018 and 2021.","date":"2023-10-29T16:29:56.000Z","link":"/2023/10/29/ielts-instagram/"},{"title":"In many countries there is a shortage of suitable people for essential jobs. What do you think are the causes of this problem and what measures could be taken to solve it?","date":"2023-10-31T01:35:36.000Z","link":"/2023/10/31/ielts-job/"}],"2023-11":[{"title":"Establishing good relationships in the workplace is not important, as the primary goal of every person is to focus on work.","date":"2023-11-01T01:46:03.000Z","link":"/2023/11/01/ielts-workplace/"},{"title":"The pie charts below illustrate the number of journal articles read per week by all students, PhD students, and junior lectures at an Australian university.","date":"2023-11-02T02:24:58.000Z","link":"/2023/11/02/ielts-reading/"},{"title":"Supervisor 監控 Flask 服務","date":"2023-11-03T01:37:40.000Z","link":"/2023/11/03/python-supervisor/"},{"title":"Everyone deserves to be educated. It’s unfair that intelligent people are not admitted to private universities because of their financial background. University education should be free for everyone.","date":"2023-11-03T02:03:09.000Z","link":"/2023/11/03/ielts-education/"},{"title":"The table below shows the changes in exports in HK billions between 2009 and 2010.","date":"2023-11-05T08:45:36.000Z","link":"/2023/11/05/ielts-exports/"},{"title":"Some people claim that immigrants should adopt the local culture when immigrating to a new country. While others think that they can establish a minority community instead.","date":"2023-11-06T01:42:49.000Z","link":"/2023/11/06/ielts-immigrant/"},{"title":"The plans below show the site of an airport now and how it will look after redevelopment next year.","date":"2023-11-07T01:45:44.000Z","link":"/2023/11/07/ielts-airport/"},{"title":"Today’s schools should teach their students how to survive financially in the world today.","date":"2023-11-08T01:00:16.000Z","link":"/2023/11/08/ielts-investment/"},{"title":"The line graph shows the average number of weekly patients visiting four clinics of a hospital from 2010 to 2016.","date":"2023-11-09T02:37:53.000Z","link":"/2023/11/09/ielts-patients/"},{"title":"Nowadays university education is considered very important for people's future. However, there are a lot of successful people who didn't get higher education.","date":"2023-11-10T06:55:19.000Z","link":"/2023/11/10/ielts-education-2/"},{"title":"The most important aim of science should be to improve people’s lives.","date":"2023-11-12T02:43:46.000Z","link":"/2023/11/12/ielts-science/"},{"title":"The graph below gives information about the percentage of the population in four Asian countries living in cities from 1970 to 2020, with prediction for 2030 and 2040.","date":"2023-11-13T01:39:34.000Z","link":"/2023/11/13/ielts-population/"},{"title":"活用你的表情符號吧！","date":"2023-11-14T04:13:30.000Z","link":"/2023/11/14/line-sticker/"},{"title":"The government should sometimes infringe on people's freedom for the security of society.","date":"2023-11-15T08:14:52.000Z","link":"/2023/11/15/ielts-government/"},{"title":"The maps show improvements that have been made to a university campus between 2010 and present day.","date":"2023-11-16T02:50:17.000Z","link":"/2023/11/16/ielts-campus/"},{"title":"Some people think that couples should live together before getting married to start knowing each other better and see if they are compatible. Others say that because of this tendency people become immoral and only deep emotional attachment makes a durable alliance.","date":"2023-11-17T02:22:15.000Z","link":"/2023/11/17/ielts-marriage/"},{"title":"Plagiarism in academics has become a pressing problem in many countries today.","date":"2023-11-22T01:49:19.000Z","link":"/2023/11/22/ielts-plagiarism/"},{"title":"The diagram below show the changes that have taken place at West park Secondary School since its construction in 1950.","date":"2023-11-23T01:58:55.000Z","link":"/2023/11/23/ielts-park/"},{"title":"Some university students want to learn about other subjects in addition to their main subjects. Other believe it is more important to give all their time and attention to studying for a qualification.","date":"2023-11-25T13:16:38.000Z","link":"/2023/11/25/ielts-university/"},{"title":"The chart below shows the number of households in the US by their annual income in 2007, 2011, and 2015.","date":"2023-11-25T15:50:17.000Z","link":"/2023/11/25/ielts-income/"},{"title":"The charts below show the number of people in Europe who were affected by four types of noise by day and by night in cities and rural areas in 2007.","date":"2023-11-26T03:48:17.000Z","link":"/2023/11/26/ielts-noise/"},{"title":"Forests produce fresh oxygen and participate in regulating climate. But every year the tree cover of our planet decreases due to deforestation.","date":"2023-11-27T01:43:41.000Z","link":"/2023/11/27/ielts-deforestation/"},{"title":"Some people hesitate between getting a job and starting their own business. While the idea of not having a boss and working on one's own schedule may sound tempting, financial risks and stress sometimes outweigh these advantages.","date":"2023-11-29T01:42:25.000Z","link":"/2023/11/29/ielts-job-2/"},{"title":"The charts below show the average percentages in typical meals of three types of nutrients, all of which may be unhealthy if eaten too much.","date":"2023-11-30T07:50:57.000Z","link":"/2023/11/30/ielts-nutrients/"}],"2023-12":[{"title":"Students should focus on learning in the classroom rather than show their status by wearing fashionable clothes. Therefore, all students have to wear school uniforms.","date":"2023-12-04T06:10:40.000Z","link":"/2023/12/04/ielts-uniforms/"},{"title":"A rise in the standard of living in a country often only seems to benefit cities rather than rural areas.","date":"2023-12-06T01:51:37.000Z","link":"/2023/12/06/ielts-living/"},{"title":"The chart shows British Emigration to selected destinations between 2004 and 2007.","date":"2023-12-07T01:36:08.000Z","link":"/2023/12/07/ielts-emigration/"},{"title":"In some countries, owning a home rather than renting one is very important for people.","date":"2023-12-31T03:28:12.000Z","link":"/2023/12/31/ielts-residence/"}],"2024-1":[{"title":"The chart below show the results of a survey about people's coffee and tea buying and drinking habits in five Australian cities.","date":"2024-01-01T03:37:01.000Z","link":"/2024/01/01/ielts-coffee-and-tea/"},{"title":"In the future, nobody will buy printed newspapers or books because they will be able to read everything they want online without paying.","date":"2024-01-03T01:59:41.000Z","link":"/2024/01/03/ielts-book-and-newspaper/"},{"title":"The graph below shows the number of tourists visiting a particular Caribbean island between 2010 and 2017.","date":"2024-01-04T09:31:30.000Z","link":"/2024/01/04/ielts-Caribbean-island/"},{"title":"The diagram below shows how instant noodles are manufactured.","date":"2024-01-08T14:30:37.000Z","link":"/2024/01/08/ielts-instant-noodles/"},{"title":"Some people say that advertising is extremely successful at persuading us to buy things. Other people think that advertising is so common that we no longer pay attention to it.","date":"2024-01-09T02:06:24.000Z","link":"/2024/01/09/ielts-advertising-2/"},{"title":"The chart below shows what Anthropology graduates from one university did after finishing their undergraduate degree course. The table shows the salaries of the anthropologists in work after five years.","date":"2024-01-11T04:00:12.000Z","link":"/2024/01/11/ielts-anthropobiology/"},{"title":"In some cultures, children are often told that they can achieve anything if they try hard enough.","date":"2024-01-14T13:16:25.000Z","link":"/2024/01/14/ielts-children/"},{"title":"The diagram below the process for recycling plastic bottles.","date":"2024-01-24T02:54:07.000Z","link":"/2024/01/24/ielts-recycling2/"},{"title":"In the future all cars, buses, and trucks will be driverless. The only people traveling inside these vehicles will be passengers.","date":"2024-01-25T01:48:34.000Z","link":"/2024/01/25/ielts-driverless/"},{"title":"Some children spend hours every day on their smartphones.","date":"2024-01-28T13:01:12.000Z","link":"/2024/01/28/ielts-smartphone/"}],"2024-2":[{"title":"The table and charts below give information on the police budget for 2017 and 2018 in one area of Britain. The table shows where the money came from and the charts show how it was distributed.","date":"2024-02-01T01:59:05.000Z","link":"/2024/02/01/ielts-police/"},{"title":"It is important for people to take risks, both in their professional lives and their personal lives.","date":"2024-02-15T09:45:36.000Z","link":"/2024/02/15/ielts-risk/"},{"title":"The maps below show an industrial area in the town of Norbiton, and planned future development of the site.","date":"2024-02-16T01:48:40.000Z","link":"/2024/02/16/ielts-future-development/"}],"2024-6":[{"title":"Two Ways to Set Up a Firewall in Linux","date":"2024-06-11T03:53:27.000Z","link":"/2024/06/11/linux-firewall/"}],"2024-7":[{"title":"Cloud Summit 2024 Participation Experience","date":"2024-07-08T08:39:19.000Z","link":"/2024/07/08/summit-cloud-2024/"}],"2025-1":[{"title":"Leetcode 735 Asteroid Collision","date":"2025-01-21T02:12:01.000Z","link":"/2025/01/21/leetcode-735/"}]}